html/python-ipython.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IPython</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">IPython</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05f8a2e">1. Commands</a>
<ul>
<li><a href="#orgdf1dda5">1.1. 功能指令</a></li>
<li><a href="#org65ad704">1.2. 编辑指令</a></li>
</ul>
</li>
<li><a href="#org11b2962">2. Tricks</a>
<ul>
<li><a href="#org17b21cb">2.1. Biolerplate</a></li>
<li><a href="#org11e217e">2.2. Remote Notebook</a></li>
<li><a href="#orgedb7605">2.3. 绘制图形的一些技巧</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org05f8a2e" class="outline-2">
<h2 id="org05f8a2e"><span class="section-number-2">1.</span> Commands</h2>
<div class="outline-text-2" id="text-1">
<p>
通常%用于测试单行语句，而%%用于块语句
</p>
</div>

<div id="outline-container-orgdf1dda5" class="outline-3">
<h3 id="orgdf1dda5"><span class="section-number-3">1.1.</span> 功能指令</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>%time: Time the execution of a single statement</li>
<li>%timeit: Time repeated execution of a single statement for more accuracy</li>
<li>%prun: Run code with the profiler</li>
<li>%lprun: Run code with the line-by-line profiler # %load_ext line_profiler</li>
<li>%memit: Measure the memory use of a single statement # %load_ext memory_profiler</li>
<li>%mprun: Run code with the line-by-line memory profiler</li>
<li>`%%cython` 用来编译cython代码, 而且必须放在在cell第一行
<ul class="org-ul">
<li>调用前用 ` %load_ext cython` 加载cython模块。</li>
</ul></li>
<li>`@numba.jit` 使用numba jit来加速数值运算。</li>
</ul>
</div>
</div>

<div id="outline-container-org65ad704" class="outline-3">
<h3 id="org65ad704"><span class="section-number-3">1.2.</span> 编辑指令</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>`!shell-command` 用来执行外部shell命令，同时可以将结果传给变量比如 `x = !pwd`.</li>
<li>%quickref 显示notebook命令</li>
<li>%history -n 1-4 历史命令1-4条</li>
<li>%debug 进入调试模式，如果需要自动打开可以使用%pdb on</li>
<li>%save filename n1-n2 保存历史上执行的命令，按照编号存取</li>
<li>%store output_variable &gt; output.txt 把变量内容输出到文件</li>
<li>%logstart/off/on/stop 可以保存ipython下面所有执行的命令</li>
<li>%reset 清除当前session下面所有的变量</li>
<li>%xdel variable 清除当前sesison的某个变量</li>
<li>%bookmark &lt;name&gt; &lt;dir&gt; / cd &lt;name&gt; / %bookmark -l 书签系统</li>
<li>%who/%whos/%who_ls 列举当前环境下所有的变量</li>
<li>%cpaste 格式化粘贴代码</li>
<li>%page variable 通过分页器打印变量</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org11b2962" class="outline-2">
<h2 id="org11b2962"><span class="section-number-2">2.</span> Tricks</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org17b21cb" class="outline-3">
<h3 id="org17b21cb"><span class="section-number-3">2.1.</span> Biolerplate</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-Python">import pandas as pd
import numpy as np
%matplotlib inline

import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

# import seaborn as sns
# sns.set()

# https://matplotlib.org/3.1.0/api/matplotlib_configuration_api.html#matplotlib.RcParams
plt.rcParams['font.sans-serif']=['SimHei'] #用来正常显示中文标签
plt.rcParams['axes.unicode_minus']=False #用来正常显示负号
plt.rcParams['figure.figsize'] = (15, 5)
# x,y轴字体大小，x属性字体大小，每个曲线标题字体大小
plt.rcParams['xtick.labelsize'] = 15
plt.rcParams['ytick.labelsize'] = 15
plt.rcParams['axes.labelsize'] = 20
plt.rcParams['legend.fontsize'] = 18

# 或者使用下面这个方式
# plt.rc('font', **{'sans-serif': ['SimHei']})
# plt.rc('axes', **{'unicode_minus': False})
# plt.rc('figure', **{'figsize': (10, 10)})

np.set_printoptions(precision=4)
pd.set_option('display.width', 5000)
pd.set_option('display.max_columns', 60)
</pre>
</div>
</div>
</div>

<div id="outline-container-org11e217e" class="outline-3">
<h3 id="org11e217e"><span class="section-number-3">2.2.</span> Remote Notebook</h3>
<div class="outline-text-3" id="text-2-2">
<p>
UPDATE @ 2016-08-26: 发现下面方法可以用来解决remote ipython notebook的问题.
</p>
<ul class="org-ul">
<li>首先在目标机器dev上启动ipython notebook. `jupyter notebook &#x2013;no-browser &#x2013;port=8888`</li>
<li>然后在本机上选择绑定端口比如1000. `ssh -L "*:10000:dev:8888" dev`</li>
</ul>

<p>
之后就可以在本地使用 `<a href="http://localhost:10000">http://localhost:10000</a>` 来访问远端的notebook了.
</p>
</div>
</div>

<div id="outline-container-orgedb7605" class="outline-3">
<h3 id="orgedb7605"><span class="section-number-3">2.3.</span> 绘制图形的一些技巧</h3>
<div class="outline-text-3" id="text-2-3">
<p>
绘制图的时候尽可能地将数据组织成为DataFrame，然后调用DataFrame的plot方法画出来。这样可以省去标注等问题，并且只需要记住DataFrame的API即可。比如要绘制两个柱状图
</p>

<div class="org-src-container">
<pre class="src src-Python">
df = pd.DataFrame()
df['a'] = a; df['b'] = b
df.hist(alpha=1, bins = 200, figsize=(20, 10))
</pre>
</div>

<p>
尽可能地让plot往DataFrame上靠，而不是将DataFrame拆开以适应plot，虽然df上的方法相比native matplotlib弱很多，但是good enough.
</p>

<hr />

<p>
此外如果需要分开两个axes来绘制的话，可以在plot时候加上参数ax
</p>

<div class="org-src-container">
<pre class="src src-Python">
fig, (ax1, ax2) = plt.subplots(1,2, sharey=True)
df_cluster['招商银行'].plot(figsize=(20, 10), ax=ax1, legend=True, color = 'r', linewidth=1)
df_cluster['中信银行'].plot(figsize=(20, 10), ax=ax2, legend=True, color = 'b', linewidth=1)
# df_cluster.plot(figsize=(20, 10), color = 'yb', linewidth=2)

</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
